
#include "digidophw.h"


#define ID_VENDOR       0x04D8
//#define ID_PRODUCT    0xaaaa
//#define STR_MANU      "HS-ULM"
//#define STR_PROD      "DigiDop"
//#define STR_SERIAL    "00000001"


// Configuration Descriptor (USB_audio_10 4.2)----------------------------------
struct pwd_config_descriptor {
    unsigned char  c_bLength;                   // 0x09
    unsigned char  c_bDescriptorType;           // 0x02 (CONFIGURATION)
    unsigned short c_wTotalLength;              // word alligned !
    unsigned char  c_bNumInterfaces;            // number
    unsigned char  c_bConfigurationValue;       // ID
    unsigned char  c_iConfiguration;            // string descriptor index
    unsigned char  c_bmAttributes;              // 0b1xx00000
    unsigned char  c_MaxPower;                  // number

// AudioControl Interface Descriptors (USB_audio_10 4.3 )-----------------------
    // (Micro.) Standard AC Interface Descriptor
    unsigned char  stdac_bLength;               // 0x09
    unsigned char  stdac_bDescriptorType;       // 0x04 (INTERFACE)
    unsigned char  stdac_bInterfaceNumber;      // 0x00
    unsigned char  stdac_bAlternateSetting;     // 0x00
    unsigned char  stdac_bNumEndpoints;         // 0x00
    unsigned char  stdac_bInterfaceClass;       // 0x01 (AUDIO)
    unsigned char  stdac_bInterfaceSubClass;    // 0x01 (AUDIOCONTROL)
    unsigned char  stdac_bInterfaceProtocol;    // number
    unsigned char  stdac_iInterface;            // index of stringdescriptor
    // (Micro.) Class-Specific AC  Interface Descriptor
    unsigned char  csac_bLength;                // 0x09
    unsigned char  csac_bDescriptorType;        // 0x24 (CS_INTERFACE)
    unsigned char  csac_bDescriptorSubtype;     // 0x01 (HEADER)
    unsigned char  csac_bcdADC_L;               // 00
    unsigned char  csac_bcdADC_H;               // 01.
    unsigned char  csac_wTotalLengt_L;          // number
    unsigned char  csac_wTotalLengt_H;          // ..
    unsigned char  csac_bInCollection;          // 0x01 (one in AS interface)
    unsigned char  csac_baInterfaceNr;          // interface number
    // (Microphone) Input Terminal Descriptor
    unsigned char  it_bLength;                  // 0x0C
    unsigned char  it_bDescriptorType;          // 0x (CS_INTERFACE)
    unsigned char  it_bDescriptorSubType;       // 0x (INPUT_TERMINAL)
    unsigned char  it_bTerminalID;              //
    unsigned char  it_wTerminalType_L;          //
    unsigned char  it_wTerminalType_H;          // ..
    unsigned char  it_bAssocTerminal;           // ID of associated outputT
    unsigned char  it_NrChannels;               //
    unsigned char  it_wChannelConfig_L;         //
    unsigned char  it_wChannelConfig_H;         // ..
    unsigned char  it_iChannelNames;            // index of stringdescriptor
    unsigned char  it_iTerminal;                // index of stringdescriptor
    // (Microphone) Output Terminal Descriptor
    unsigned char  ot_bLength;                  // 0x09
    unsigned char  ot_bDescriptorType;          // 0x (CS_INTERFACE)
    unsigned char  ot_bDescriptorSubType;       // 0x (OUPUT_TERMINAL)
    unsigned char  ot_bTerminalID;              //
    unsigned char  ot_wTerminalType_L;          //
    unsigned char  ot_wTerminalType_H;          // ..
    unsigned char  ot_bAssocTerminal;           // ID of associated outputT
    unsigned char  ot_bSourceID;                //
    unsigned char  ot_iTerminal;                // index of stringdescriptor

// AudioStreaming Interface Descriptor (USB_audio_10 4.5) ----------------------
    // Standard AS Interface Descriptor (alternate setting 0)
    unsigned char  stdas_a0_bLength;            // 0x09
    unsigned char  stdas_a0_bDescriptorType;    // INTERFACE
    unsigned char  stdas_a0_bInterfaceNumber;   //
    unsigned char  stdas_a0_bAlternateSetting;  //
    unsigned char  stdas_a0_bNumEndpoints;      //
    unsigned char  stdas_a0_bInterfaceClass;    // AUDIO
    unsigned char  stdas_a0_bInterfaceSubClass; // AUDIO_STREAMING
    unsigned char  stdas_a0_bInterfaceProtocol; // 0x00 (not used)
    unsigned char  stdas_a0_iInterface;         // index of stringdescriptor
    // Standard AS Interface Descriptor (alternate setting 1)
    unsigned char  stdas_a1_bLength;            // 0x09
    unsigned char  stdas_a1_bDescriptorType;    // INTERFACE
    unsigned char  stdas_a1_bInterfaceNumber;   //
    unsigned char  stdas_a1_bAlternateSetting;  //
    unsigned char  stdas_a1_bNumEndpoints;      //
    unsigned char  stdas_a1_bInterfaceClass;    // AUDIO
    unsigned char  stdas_a1_bInterfaceSubClass; // AUDIO_STREAMING
    unsigned char  stdas_a1_bInterfaceProtocol; // 0x00 (not used)
    unsigned char  stdas_a1_iInterface;         // index of stringdescriptor
    // Class-Specific AS Interface Descriptor
    unsigned char  csas_bLength;                // 0x07
    unsigned char  csas_bDescriptorType;        // 0x24 (CS_INTERFACE)
    unsigned char  csas_bDescriptorSubtype;     //
    unsigned char  csas_bTerminalLink;          //
    unsigned char  csas_bDelay;                 //
    unsigned char  csas_wFormatTag_L;           //
    unsigned char  csas_wFormatTag_H;           // ..
    // CS AS Format Type Descriptor  (USB Audio Data Formats)
    unsigned char  asft_bLength;                // 0x0B
    unsigned char  asft_bDescriptorType;        // 0x (CS_INTERFACE)
    unsigned char  asft_bDescriptorSubType;     // 0x (FORMAT_TYPE)
    unsigned char  asft_bFormatType;            // FORMAT_TYPE_I
    unsigned char  asft_bNrChannels;            //
    unsigned char  asft_bSubframeSize;          //
    unsigned char  asft_BitResolution;          //
    unsigned char  asft_SamFreqType;            //
    unsigned char  asft_tLowerSamFreq_L;        //
    unsigned char  asft_tLowerSamFreq_H;        // ..
    unsigned char  asft_tLowerSamFreq_U;        // ..
// Audio Streaming Endpoint Deskriptor
    // Standard AS Endpoint Descriptor
    unsigned char  stdep_bLength;               // 0x09
    unsigned char  stdep_bDescriptorType;       // ENDPOINT
    unsigned char  stdep_bEndpointAddress;
    unsigned char  stdep_bmAttributes;
    unsigned char  stdep_wMaxPacketSize_LB;
    unsigned char  stdep_wMaxPacketSize_HB;     // ..
    unsigned char  stdep_bInterval;
    unsigned char  stdep_bRefresh;
    unsigned char  stdep_bSynchAddress;
    // CS AS Endpoint Descriptor
    unsigned char  csep_bLength;                // 0x07
    unsigned char  csep_bDescriptorType;        // CS_ENDPOINT
    unsigned char  csep_bDescriptorSubtype;     // EP_GENERAL
    unsigned char  csep_bmAtributes;            //
    unsigned char  csep_bLockDelayUnits;        //
    unsigned char  csep_wLockDelay_L;           //
    unsigned char  csep_wLockDelay_H;           // ..

    char extra[45];
};

//##############################################################################
//##############################################################################
/*******************************************************************************
 * Class:           DigiDopHW
 *
 * Overview:        Implements the USB PulsWaweDoppler HW
 *
 * Note:            Subclass isoDataMonitor is needed to perform isochrounous
 *                  read of doppler data !
*
 ******************************************************************************/
